Catalogs/ГруппыБанков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<Catalog>
		<Properties>
			<Name>ГруппыБанков</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>Банки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Банк</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Банки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаНачала</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОкончания</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ГруппыБанков/Ext/ManagerModule.bsl
Функция ПолучитьГруппуБанковПоБанку(Банк, ДатаПроверки) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ГруппыБанковБанки.Ссылка
	               |ИЗ
	               |	Справочник.ГруппыБанков.Банки КАК ГруппыБанковБанки
	               |ГДЕ
	               |	ГруппыБанковБанки.Банк = &Банк
	               |	И &ДатаДоговора МЕЖДУ НАЧАЛОПЕРИОДА(ГруппыБанковБанки.ДатаНачала, ДЕНЬ) И КОНЕЦПЕРИОДА(ГруппыБанковБанки.ДатаОкончания, ДЕНЬ)";
	Запрос.УстановитьПараметр("Банк", Банк);
	Запрос.УстановитьПараметр("ДатаДоговора", ДатаПроверки);
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
КонецФункции
